<a href="https://colab.research.google.com/github/shaarialwi/Data-analyst/blob/main/Titanic_test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Start by connecting gdrive into the google colab

from google.colab import auth
auth.authenticate_user()
import gspread
from oauth2client.client import GoogleCredentials
gc = gspread.authorize(GoogleCredentials.get_application_default())

In [2]:
#import libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
#import dataset
wb = gc.open_by_url('https://docs.google.com/spreadsheets/d/1jzYSv02VYqerJle3VaND6mxN7fa6yjehUCrSd79zLrY/edit#gid=1387592718')
wks = wb.worksheet('train')
data = wks.get_all_values()

In [5]:
df = pd.DataFrame(data)
df.columns = df.iloc[0]
df = df.iloc[1:]

In [6]:
df.head()

0 PassengerId Survived Pclass  ...     Fare Cabin Embarked
1           1        0      3  ...     7.25              S
2           2        1      1  ...  71.2833   C85        C
3           3        1      3  ...    7.925              S
4           4        1      1  ...     53.1  C123        S
5           5        0      3  ...     8.05              S

[5 rows x 12 columns]

In [7]:
print(df)

0   PassengerId Survived Pclass  ...     Fare Cabin Embarked
1             1        0      3  ...     7.25              S
2             2        1      1  ...  71.2833   C85        C
3             3        1      3  ...    7.925              S
4             4        1      1  ...     53.1  C123        S
5             5        0      3  ...     8.05              S
..          ...      ...    ...  ...      ...   ...      ...
887         887        0      2  ...       13              S
888         888        1      1  ...       30   B42        S
889         889        0      3  ...    23.45              S
890         890        1      1  ...       30  C148        C
891         891        0      3  ...     7.75              Q

[891 rows x 12 columns]